       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     HELLO.
       DATA            DIVISION.
       FILE            SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE       DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "ワタクシ、やればできる子ですので"
            STOP RUN.
       END PROGRAM HELLO.
